[Lucu_Garage_Xtopod X2SoldierClassTemplate]
DisplayName="Xtopod"
ClassSummary="A little Sectopod!"
LeftAbilityTreeTitle="Big"
RightAbilityTreeTitle="Angry"

[Lucu_Garage_Country_Xtopod X2CountryTemplate]
DisplayName="The United Xtopods of Earth"
DisplayNameWithArticle="The United Xtopods"
DisplayNameWithArticleLower="the United Xtopods"
DisplayNamePossessive="Xtopods'"
DisplayAdjective="Xtopodian"

;-------------------------------------------------------------------------------------------
; Primary Weapons
;-------------------------------------------------------------------------------------------

[Lucu_Garage_StandardShotPower X2AbilityTemplate]
LocFriendlyName="Fire Weapon"
LocHelpText="Fire a shot at a target."
LocLongDescription="<Bullet/>Firing the primary weapon always ends a unit's turn."

[Lucu_Garage_Reload X2AbilityTemplate]
LocFriendlyName="Reload"
LocHelpText="Reload your primary weapon."
LocFlyOverText="Reloading"

[Lucu_Garage_FreeReload X2AbilityTemplate]
LocFriendlyName="Reload (Free)"
LocHelpText="Reload your primary weapon."
LocFlyOverText="Reloading"

[Lucu_Garage_Breacher_Cnv X2WeaponTemplate]
FriendlyName="Xtopod Breacher"
FriendlyNamePlural="Xtopod Breachers"
BriefSummary="A high-power but inaccurate cannon rigged for mounting on a Mini-Sectopod."
TacticalText="A high-power but inaccurate cannon rigged for mounting on a Mini-Sectopod."

[Lucu_Garage_Breacher_Las X2WeaponTemplate]
FriendlyName="Xtopod Laser Breacher"
FriendlyNamePlural="Xtopod Laser Breachers"
BriefSummary="A high-power but inaccurate cannon rigged for mounting on a Mini-Sectopod."
TacticalText="A high-power but inaccurate cannon rigged for mounting on a Mini-Sectopod."

[Lucu_Garage_Breacher_Mag X2WeaponTemplate]
FriendlyName="Xtopod Mag Breacher"
FriendlyNamePlural="Xtopod Mag Breachers"
BriefSummary="A high-power but inaccurate cannon rigged for mounting on a Mini-Sectopod."
TacticalText="A high-power but inaccurate cannon rigged for mounting on a Mini-Sectopod."

[Lucu_Garage_Breacher_Beam X2WeaponTemplate]
FriendlyName="Xtopod Plasma Breacher"
FriendlyNamePlural="Xtopod Plasma Breachers"
BriefSummary="A high-power but inaccurate cannon rigged for mounting on a Mini-Sectopod."
TacticalText="A high-power but inaccurate cannon rigged for mounting on a Mini-Sectopod."

[Lucu_Garage_Shatterer_Cnv X2WeaponTemplate]
FriendlyName="Xtopod Shatterer"
FriendlyNamePlural="Xtopod Shatterers"
BriefSummary="A bulky, high-speed rotary cannon rigged for mounting on a Mini-Sectopod."
TacticalText="A bulky, high-speed rotary cannon rigged for mounting on a Mini-Sectopod."

[Lucu_Garage_Shatterer_Las X2WeaponTemplate]
FriendlyName="Xtopod Laser Shatterer"
FriendlyNamePlural="Xtopod Laser Shatterers"
BriefSummary="A bulky, high-speed rotary cannon rigged for mounting on a Mini-Sectopod."
TacticalText="A bulky, high-speed rotary cannon rigged for mounting on a Mini-Sectopod."

[Lucu_Garage_Shatterer_Mag X2WeaponTemplate]
FriendlyName="Xtopod Mag Shatterer"
FriendlyNamePlural="Xtopod Mag Shatterers"
BriefSummary="A bulky, high-speed rotary cannon rigged for mounting on a Mini-Sectopod."
TacticalText="A bulky, high-speed rotary cannon rigged for mounting on a Mini-Sectopod."

[Lucu_Garage_Shatterer_Beam X2WeaponTemplate]
FriendlyName="Xtopod Plasma Shatterer"
FriendlyNamePlural="Xtopod Plasma Shatterers"
BriefSummary="A bulky, high-speed rotary cannon rigged for mounting on a Mini-Sectopod."
TacticalText="A bulky, high-speed rotary cannon rigged for mounting on a Mini-Sectopod."

[Lucu_Garage_Gun_Cnv X2WeaponTemplate]
FriendlyName="Xtopod Turret"
FriendlyNamePlural="Xtopod Turrets"
BriefSummary="A typical gun rigged for mounting on a Mini-Sectopod."
TacticalText="A typical gun rigged for mounting on a Mini-Sectopod."

[Lucu_Garage_Gun_Las X2WeaponTemplate]
FriendlyName="Xtopod Laser Turret"
FriendlyNamePlural="Xtopod Laser Turrets"
BriefSummary="A typical gun rigged for mounting on a Mini-Sectopod."
TacticalText="A typical gun rigged for mounting on a Mini-Sectopod."

[Lucu_Garage_Gun_Mag X2WeaponTemplate]
FriendlyName="Xtopod Mag Turret"
FriendlyNamePlural="Xtopod Mag Turrets"
BriefSummary="A typical gun rigged for mounting on a Mini-Sectopod."
TacticalText="A typical gun rigged for mounting on a Mini-Sectopod."

[Lucu_Garage_Gun_Beam X2WeaponTemplate]
FriendlyName="Xtopod Plasma Turret"
FriendlyNamePlural="Xtopod Plasma Turrets"
BriefSummary="A typical gun rigged for mounting on a Mini-Sectopod."
TacticalText="A typical gun rigged for mounting on a Mini-Sectopod."

;-------------------------------------------------------------------------------------------
; Secondary Weapons
;-------------------------------------------------------------------------------------------

[Lucu_Garage_MiniRocket X2WeaponTemplate]
FriendlyName="Xtopod Mini Rocket"
FriendlyNamePlural="Xtopod Mini Rockets"
BriefSummary="A rotary launcher for miniature rockets for Xtopod units.<br/><Bullet/> Does not end the Xtopod's turn.<br/>"
TacticalText="A rotary launcher for miniature rockets for Xtopod units.<br/><Bullet/> Does not end the Xtopod's turn.<br/>"

[Lucu_Garage_BlasterCannon X2WeaponTemplate]
FriendlyName="Xtopod Blaster Cannon"
FriendlyNamePlural="Xtopod Blaster Cannon"
BriefSummary="A secondary weapon system for Xtopod units that launches a ball of superheated plasma."
TacticalText="A secondary weapon system for Xtopod units that launches a ball of superheated plasma."

[Lucu_Garage_PlasmaBeam X2WeaponTemplate]
FriendlyName="Xtopod Plasma Beam"
FriendlyNamePlural="Xtopod Plasma Beam"
BriefSummary="A secondary weapon system for Xtopod units that fires a beam of superheated plasma."
TacticalText="A secondary weapon system for Xtopod units that fires a beam of superheated plasma."

[Lucu_Garage_WrathCannon X2WeaponTemplate]
FriendlyName="Xtopod Wrath Cannon"
FriendlyNamePlural="Xtopod Wrath Cannon"
BriefSummary="A smaller version of the Wrath Cannon for Xtopod units."
TacticalText="A smaller version of the Wrath Cannon for Xtopod units."

[Lucu_Garage_ShredderCannon X2WeaponTemplate]
FriendlyName="Xtopod Shredder Cannon"
FriendlyNamePlural="Xtopod Shredder Cannon"
BriefSummary="A secondary weapon system for Xtopod units that fires high velocity sprays of shrapnel."
TacticalText="A secondary weapon system for Xtopod units that fires high velocity sprays of shrapnel."

[Lucu_Garage_Mortar X2WeaponTemplate]
FriendlyName="Xtopod Mortar"
FriendlyNamePlural="Xtopod Mortar"
BriefSummary="A secondary weapon system for Xtopod units that fires powerful, long-range explosive shells."
TacticalText="A secondary weapon system for Xtopod units that fires powerful, long-range explosive shells."

[Lucu_Garage_Flamethrower X2WeaponTemplate]
FriendlyName="Xtopod Flamethrower"
FriendlyNamePlural="Xtopod Flamethrower"
BriefSummary="A secondary weapon system for Xtopod units that sprays waves of flaming napalm."
TacticalText="A secondary weapon system for Xtopod units that sprays waves of flaming napalm."

;-------------------------------------------------------------------------------------------
; Secondary Weapon Abilities
;-------------------------------------------------------------------------------------------

[Lucu_Garage_MiniRocket X2AbilityTemplate]
LocFriendlyName="Mini-Rocket"
LocLongDescription="Fire a mini-rocket at the target area.<Bullet/> Does not end the Xtopod's turn.<br/>"
LocHelpText="Fire a mini-rocket at the target area.<br/><Bullet/> Does not end the Xtopod's turn.<br/>"
LocFlyOverText="Mini-Rocket"
LocPromotionPopupText="Fire a mini-rocket at the target area.<br/><Bullet/> Does not end the Xtopod's turn.<br/>"

[Lucu_Garage_BlasterCannon X2AbilityTemplate]
LocFriendlyName="Blaster Cannon"
LocLongDescription="Fire your Blaster Cannon at the target area."
LocHelpText="Fire your Blaster Cannon at the target area."
LocFlyOverText="Blaster Cannon"
LocPromotionPopupText="Fire your Blaster Cannon at the target area."

[Lucu_Garage_PlasmaBeam X2AbilityTemplate]
LocFriendlyName="Plasma Beam"
LocLongDescription="Fire your Plasma Beam at the target area."
LocHelpText="Fire your Plasma Beam at the target area."
LocFlyOverText="Plasma Beam"
LocPromotionPopupText="Fire your Plasma Beam at the target area."

[Lucu_Garage_WrathCannon X2AbilityTemplate]
LocFriendlyName="Wrath Cannon"
LocLongDescription="Fire your Wrath Cannon at the target area."
LocHelpText="Fire your Wrath Cannon at the target area."
LocFlyOverText="Wrath Cannon"
LocPromotionPopupText="Fire your Wrath Cannon at the target area."

[Lucu_Garage_ShredderCannon X2AbilityTemplate]
LocFriendlyName="Shredder Cannon"
LocLongDescription="Fire your Shredder Cannon at the target area."
LocHelpText="Fire your Shredder Cannon at the target area."
LocFlyOverText="Shredder Cannon"
LocPromotionPopupText="Fire your Shredder Cannon at the target area."

[Lucu_Garage_Mortar X2AbilityTemplate]
LocFriendlyName="Mortar"
LocLongDescription="Fire your Mortar at the target area."
LocHelpText="Fire your Mortar at the target area."
LocFlyOverText="Mortar"
LocPromotionPopupText="Fire your Mortar at the target area."

[Lucu_Garage_Flamethrower X2AbilityTemplate]
LocFriendlyName="Flamethrower"
LocLongDescription="Fire your Flamethrower at the target area."
LocHelpText="Fire your Flamethrower at the target area."
LocFlyOverText="Flamethrower"
LocPromotionPopupText="Fire your Flamethrower at the target area."

;-------------------------------------------------------------------------------------------
; Plating Abilities
;-------------------------------------------------------------------------------------------

[Lucu_Garage_DefaultPower X2AbilityTemplate]
LocFriendlyName="Power Core"

[Lucu_Garage_WallBreakingOn X2AbilityTemplate]
LocFriendlyName="Wall-Breaking"
LocLongDescription="Allows the Xtopod to break through walls and other obstacles."
LocHelpText="<Bullet/> Allows the Xtopod to break through walls and other obstacles.<br/><Bullet/> Breaks concealment.<br/><Bullet/> Free action.<br/>"
LocFlyOverText="Wall-Breaking"
LocPromotionPopupText="<Bullet/> Allows the Xtopod to break through walls and other obstacles.<br/><Bullet/> Breaks concealment.<br/><Bullet/> Free action.<br/>"

[Lucu_Garage_WallBreakingOff X2AbilityTemplate]
LocFriendlyName="Wall-Breaking"
LocLongDescription="Stops the Xtopod from breaking through walls and other obstacles."
LocHelpText="<Bullet/> Allows the Xtopod to break through walls and other obstacles.<br/><Bullet/> Breaks concealment.<br/><Bullet/> Free action.<br/>"
LocFlyOverText="Wall-Breaking"
LocPromotionPopupText="<Bullet/> Stops the Xtopod from breaking through walls and other obstacles.<br/><Bullet/> Breaks concealment.<br/><Bullet/> Free action.<br/>"

;-------------------------------------------------------------------------------------------
; Utility Item Weapons
;-------------------------------------------------------------------------------------------

[Lucu_Garage_SmokescreenWeapon X2WeaponTemplate]
FriendlyName="Xtopod Smokescreen"
FriendlyNamePlural="Xtopod Smokescreens"
BriefSummary="Releases a cloud of smoke around the Xtopod, increasing the defense of affected targets.<br/>Increased radius with chassis tier."
TacticalText="<Bullet/> Releases a cloud of smoke around the Xtopod, increasing the defense of affected targets.<br/><Bullet/> Increased radius with chassis tier.<br/>"
TinySummary="Xtopod Smokescreen"

;-------------------------------------------------------------------------------------------
; Utility Item Abilities
;-------------------------------------------------------------------------------------------

[Lucu_Garage_AuxiliaryGenerator X2AbilityTemplate]
LocFriendlyName="Auxiliary Power Core"

[Lucu_Garage_AdaptiveCamoPhantom X2AbilityTemplate]
LocFriendlyName="Adaptive Camo"
LocLongDescription="When the squad is revealed, this soldier remains concealed."
LocHelpText="When the squad is revealed, this soldier remains concealed."
LocFlyOverText="Adaptive Camo"
LocPromotionPopupText="<Bullet/> When the squad is revealed, this soldier remains concealed.<br/>"

[Lucu_Garage_AdaptiveCamoStealth X2AbilityTemplate]
LocFriendlyName="Adaptive Camo"
LocLongDescription="Immediately enter concealment."
LocHelpText="Immediately enter concealment."
LocFlyOverText="Adaptive Camo"
LocPromotionPopupText="<Bullet/> Immediately enter concealment.<br/><Bullet/> 3 power.<br/><Bullet/> Free action.<br/><Bullet/> 3 turn cooldown.<br/>"

[Lucu_Garage_HardenedArmor X2AbilityTemplate]
LocFriendlyName="Hardened Armor"
LocLongDescription="The Xtopod has -10% chance of being critically hit per chassis tier."
LocHelpText="The Xtopod has -10% chance of being critically hit per chassis tier."
LocFlyOverText="Hardened Armor"
LocPromotionPopupText="<Bullet/> -10% chance of being critically hit per chassis tier.<br/>"

[Lucu_Garage_LaserTargeter X2AbilityTemplate]
LocFriendlyName="Laser Targeter"
LocLongDescription="Grants the Xtopod +10% to +20% critical chance based on distance to the target."
LocHelpText="Grants the Xtopod +10% to +20% critical chance based on distance to the target."
LocFlyOverText="Laser Targeter"
LocPromotionPopupText="<Bullet/> +10% to +20% critical chance based on distance to the target.<br/>"

[Lucu_Garage_AdvancedOptics X2AbilityTemplate]
LocFriendlyName="Advanced Optics"
LocLongDescription="Grants the Xtopod +3 aim per chassis tier."
LocHelpText="Grants the Xtopod +3 aim per chassis tier."
LocFlyOverText="Advanced Optics"
LocPromotionPopupText="<Bullet/> +3 aim per chassis tier.<br/>"

[Lucu_Garage_LaserTargeter X2AbilityTemplate]
LocFriendlyName="Laser Targeter"
LocLongDescription="Grants the Xtopod +1 health per chassis tier."
LocHelpText="Grants the Xtopod +1 health per chassis tier."
LocFlyOverText="Laser Targeter"
LocPromotionPopupText="<Bullet/> +1 health per chassis tier.<br/>"

[Lucu_Garage_SmokescreenItem X2AbilityTemplate]
LocFriendlyName="Smokescreen"
LocLongDescription="Releases a cloud of smoke around the Xtopod, increasing the defense of affected targets.<br/>Increased radius with chassis tier."
LocHelpText="Releases a cloud of smoke around the Xtopod, increasing the defense of affected targets.<br/>Increased radius with chassis tier."
LocFlyOverText="Smokescreen"
LocPromotionPopupText="<Bullet/> Releases a cloud of smoke around the Xtopod, increasing the defense of affected targets.<br/><Bullet/> Increased radius with chassis tier.<br/>"

[Lucu_Garage_SmokescreenWeapon X2AbilityTemplate]
LocFriendlyName="Smokescreen"
LocLongDescription="Releases a cloud of smoke around the Xtopod, increasing the defense of affected targets.<br/>Increased radius with chassis tier."
LocHelpText="Releases a cloud of smoke around the Xtopod, increasing the defense of affected targets.<br/>Increased radius with chassis tier."
LocFlyOverText="Smokescreen"
LocPromotionPopupText="<Bullet/> Releases a cloud of smoke around the Xtopod, increasing the defense of affected targets.<br/><Bullet/> Increased radius with chassis tier.<br/>"

[Lucu_Garage_LaserTargeter X2AbilityTemplate]
LocFriendlyName="Laser Targeter"
LocLongDescription="Grants the Xtopod +1 health per chassis tier."
LocHelpText="Grants the Xtopod +1 health per chassis tier."
LocFlyOverText="Laser Targeter"
LocPromotionPopupText="<Bullet/> +1 health per chassis tier.<br/>"

[Lucu_Garage_AbsorptionField X2AbilityTemplate]
LocFriendlyName="Absorption Field"
LocLongDescription="Reduces incoming damage by 50% for 1 turn."
LocHelpText="Reduces incoming damage by 50% for 1 turn."
LocFlyOverText="Absorption Field"
LocPromotionPopupText="<Bullet/> -50% incoming damage for 1 turn.<br/><Bullet/> 1 turn duration.<br/><Bullet/> 3 power.<br/><Bullet/> Free action.<br/><Bullet/> 3 turn cooldown.<br/>"

[Lucu_Garage_ShieldGenerator X2AbilityTemplate]
LocFriendlyName="Energy Shield"
LocLongDescription="Project an energy shield around yourself."
LocHelpText="Project an energy shield around yourself."
LocFlyOverText="Energy Shield"
LocPromotionPopupText="<Bullet/> Project an energy shield around yourself.<br/><Bullet/> 3 turn duration.<br/><Bullet/> 5 power.<br/><Bullet/> 1 action point.<br/><Bullet/> 4 turn cooldown.<br/>"

;-------------------------------------------------------------------------------------------
; Perk Abilities
;-------------------------------------------------------------------------------------------

[Lucu_Sniper_CoverTarget X2AbilityTemplate]
LocFriendlyName="Cover Target"
LocLongDescription="Cover a single target."
LocHelpText="Cover a single target."
LocFlyOverText="Cover Target"
LocPromotionPopupText="<Bullet/> Cover a single target with Overwatch.<br/>"
